{"gen": 2, "idx": 2, "p_human": 0.8764999348103014, "p_human_pct": 87.64999348103014, "len_chars": 711, "preview": "There was a bird that hit the sliding glass door during a heatwave. I remember finding it. It was still twitching. Its chest heaving in this frantic, uneven way that made my own st...", "text": "There was a bird that hit the sliding glass door during a heatwave. I remember finding it. It was still twitching. Its chest heaving in this frantic, uneven way that made my own stomach hurt. I knelt on the patio stones, they were burning hot. My shadow covered the creature. I reached a finger out—but then I pulled back. I wanted to help it, but I was scared, too. Terrified it might die right when I touched it, as if the life leaving it could somehow get on me. I watched it for what felt like hours. I was stuck between getting my mom and just... needing to see what happened next. When it stopped moving, the backyard felt different. Sharper, I guess. Less like a playground than it had been that morning."}
{"gen": 2, "idx": 1, "p_human": 0.8329656624339, "p_human_pct": 83.29656624339, "len_chars": 737, "preview": "I remember finding a bird during a mid-day heatwave. It had hit the sliding glass door. Twitching, still. Its tiny chest heaved in a frantic, uneven rhythm that made my stomach tur...", "text": "I remember finding a bird during a mid-day heatwave. It had hit the sliding glass door. Twitching, still. Its tiny chest heaved in a frantic, uneven rhythm that made my stomach turn over. I knelt on the scorching patio stones. My shadow fell over the creature as I reached out a finger—then pulled it back. I wanted to help it, I think. But I was terrified, too, that it might actually die while I was touching it. As if the life leaving it would somehow rub off on me. I watched it for what felt like hours. Caught between the urge to run for my mom and a strange, quiet need to see what happened next. When it finally went still, the backyard felt different. Sharper, somehow. Much less like a playground than it had been that morning."}
{"gen": 2, "idx": 4, "p_human": 0.8075928033268805, "p_human_pct": 80.75928033268805, "len_chars": 644, "preview": "I was halfway down the stairs when the basement bulb burned out. It left me in a darkness so thick it felt like it had mass. Normally, I would have yelled for someone, but that nig...", "text": "I was halfway down the stairs when the basement bulb burned out. It left me in a darkness so thick it felt like it had mass. Normally, I would have yelled for someone, but that night I just... stopped. I gripped the banister. Hard enough that the wood bit into my palm. I could hear the furnace droning, the TV upstairs, but those sounds felt miles away. I made myself take a step down, then another one, my heart thumping against my ribs. I didn't find anything in the shadows, of course. But when I flipped the switch at the bottom, the yellow light wasn't a relief. It felt like a disappointment, honestly. Just something I had to live with."}
{"gen": 2, "idx": 6, "p_human": 0.7620917316064395, "p_human_pct": 76.20917316064396, "len_chars": 677, "preview": "The circus came to town, and sure, I liked the tall man on stilts... but the lions in those traveling cages, they made my throat dry. I stood inches from the bars—rusted ones—close...", "text": "The circus came to town, and sure, I liked the tall man on stilts... but the lions in those traveling cages, they made my throat dry. I stood inches from the bars—rusted ones—close enough to smell the raw, gamey scent. Breath. I saw yellow chips in their teeth. One of them let out this low, vibrating growl I felt in my teeth, and I stepped back fast. Tripped over a peg, I think. I looked at the trainer and he was just laughing. Smoking a cigarette. I didn't get how he could be that casual around something so dangerous. It bothered me for days after. Just this sense that the world has all these sharp edges that people ignore because, I don't know, they have stuff to do."}
{"gen": 2, "idx": 3, "p_human": 0.718224598634315, "p_human_pct": 71.8224598634315, "len_chars": 690, "preview": "The bulb in the basement just... sizzled out. I was only halfway down. It left me suspended in this dark that was so thick, it felt like it had actual weight. Usually I’d scream fo...", "text": "The bulb in the basement just... sizzled out. I was only halfway down. It left me suspended in this dark that was so thick, it felt like it had actual weight. Usually I’d scream for help, but that night I just stayed there. Gripping the banister until the wood dug into my hand. I could hear the furnace, and the TV mumbling upstairs, but they sounded like they were from a totally different world. I forced myself down a step. Then another. My heart was hammering this frantic rhythm against my ribs. Obviously, I didn't find anything lurking. But when I finally hit the switch at the bottom, the yellow light... it didn't feel like a rescue. More like a disappointment I had to deal with."}
{"gen": 2, "idx": 5, "p_human": 0.6428180318064962, "p_human_pct": 64.28180318064962, "len_chars": 677, "preview": "When the circus came to town, I was fascinated by the stilt-walker, I guess... but the lions. In those cramped cages. They made my throat go dry. I was standing inches from the rus...", "text": "When the circus came to town, I was fascinated by the stilt-walker, I guess... but the lions. In those cramped cages. They made my throat go dry. I was standing inches from the rusted bars. Close enough to smell them—raw, gamey. Their breath. I could see the yellow chips in their teeth. Then one let out a low growl that vibrated in my jaw, and I stepped back so fast I think I tripped over a tent peg. I looked at the trainer. He was just laughing, smoking a cigarette. I couldn't understand how he could be so casual. Around something that dangerous. It bothered me for days, the sense that the world is full of sharp edges people just ignore because they have chores to do."}
