{"gen": 0, "idx": 4, "p_human": 0.8179828705708594, "p_human_pct": 81.79828705708594, "len_chars": 748, "preview": "I remember finding a bird that had hit the sliding glass door during a mid-day heatwave. It was still twitching, its tiny chest heaving in a frantic, uneven rhythm that made my own...", "text": "I remember finding a bird that had hit the sliding glass door during a mid-day heatwave. It was still twitching, its tiny chest heaving in a frantic, uneven rhythm that made my own stomach turn over. I knelt on the scorching patio stones, my shadow falling over the creature as I reached out a finger, then pulled it back. I wanted to help it, but I was also terrified that it might actually die while I was touching it, as if the life leaving it would somehow rub off on me. I watched it for what felt like hours, caught between the urge to run for my mom and the strange, quiet need to see what happened next. When it finally went still, the backyard felt different—sharper, somehow, and much less like a playground than it had been that morning."}
{"gen": 0, "idx": 8, "p_human": 0.709083892565517, "p_human_pct": 70.9083892565517, "len_chars": 721, "preview": "When the circus came to town, I was mostly fascinated by the tall man who walked on stilts, but the lions in their cramped, traveling cages made my throat feel dry. I stood just in...", "text": "When the circus came to town, I was mostly fascinated by the tall man who walked on stilts, but the lions in their cramped, traveling cages made my throat feel dry. I stood just inches from the rusted bars, close enough to smell the raw, gamey scent of their breath and see the yellowed chips in their teeth. One of them let out a low, vibrating growl that I felt in my teeth, and I stepped back so fast I tripped over a tent peg. I looked at the trainer, who was laughing and smoking a cigarette, and I couldn't understand how he could be so casual around something so dangerous. It bothered me for days afterward, this sense that the world was full of sharp edges that people just ignored because they had chores to do."}
{"gen": 0, "idx": 7, "p_human": 0.6504119041292626, "p_human_pct": 65.04119041292627, "len_chars": 758, "preview": "The basement lightbulb burned out while I was halfway down the stairs, leaving me suspended in a thick, velvety blackness that felt like it had weight. Usually, I would have scream...", "text": "The basement lightbulb burned out while I was halfway down the stairs, leaving me suspended in a thick, velvety blackness that felt like it had weight. Usually, I would have screamed for someone to help me, but that night I just stayed there, gripping the wooden railing until the splinters bit into my palm. I could hear the furnace humming and the distant, muffled sound of the television upstairs, but they felt like they belonged to a different world. I forced myself to take one more step down, then another, my heart thumping a frantic rhythm against my ribs. I didn't find whatever was lurking in the dark, but when I finally reached the switch at the bottom, the yellow light felt less like a rescue and more like a disappointment I had to live with."}
{"gen": 0, "idx": 6, "p_human": 0.6427029812742733, "p_human_pct": 64.27029812742732, "len_chars": 740, "preview": "There was a storm cellar behind our rental house that stayed flooded for most of the spring, creating a murky, green soup that my mother warned me was full of water moccasins. I us...", "text": "There was a storm cellar behind our rental house that stayed flooded for most of the spring, creating a murky, green soup that my mother warned me was full of water moccasins. I used to stand on the bottom step, just above the water line, peering into the shadows where the light couldn't penetrate. I had a long stick I’d use to poke at the floating debris, half-hoping to stir up a monster and half-ready to bolt for the porch. One day, I saw a pale, bloated shape rise near the surface, and for a second, I forgot how to breathe. It turned out to be just a discarded plastic jug, but the adrenaline left me feeling shaky and strange. I climbed out and wiped my muddy hands on my jeans, suddenly feeling too old to be playing in the dirt."}
{"gen": 0, "idx": 2, "p_human": 0.6229754702752905, "p_human_pct": 62.297547027529056, "len_chars": 783, "preview": "My grandfather had a locked roll-top desk in the corner of his study that smelled intensely of cherry tobacco and old, yellowing paper. One rainy Tuesday when the house was unnervi...", "text": "My grandfather had a locked roll-top desk in the corner of his study that smelled intensely of cherry tobacco and old, yellowing paper. One rainy Tuesday when the house was unnervingly silent, I found the key hidden inside a ceramic owl on the mantel. My hands were shaking so hard I nearly dropped it, convinced he’d materialize out of thin air to catch me. When the desk finally creaked open, I didn't find the gold or secret maps I’d imagined. Instead, there were just stacks of boring legal documents and a grainy black-and-white photo of him looking young and surprisingly tired. The thrill of the heist vanished instantly, replaced by a hollow thrum in my chest. I realized then that adults had complicated lives that had nothing to do with me, and I quietly locked it back up."}
{"gen": 0, "idx": 9, "p_human": 0.5877974297979439, "p_human_pct": 58.77974297979439, "len_chars": 732, "preview": "I found a stash of old, handwritten letters in the back of a closet once, tied together with a fraying blue ribbon that left lint on my fingers. They were from my grandmother to a ...", "text": "I found a stash of old, handwritten letters in the back of a closet once, tied together with a fraying blue ribbon that left lint on my fingers. They were from my grandmother to a man whose name I’d never heard, filled with words that seemed too big and too desperate for the woman I knew. I sat on the floor with my legs crossed, reading by the sliver of light coming through the door, my ears straining for the sound of footsteps in the hallway. I felt like I was peeking through a keyhole into a room I wasn't supposed to enter. It made me feel small and temporary, like I was just a footnote in a much longer, more complicated book. I put them back exactly where I found them, but the closet never felt like a hiding spot again."}
{"gen": 0, "idx": 5, "p_human": 0.5720305332875291, "p_human_pct": 57.20305332875291, "len_chars": 733, "preview": "The attic stairs were a steep, narrow throat leading into the dark heat of the roof, and I only went up there when I was looking for something specific. One afternoon, while huntin...", "text": "The attic stairs were a steep, narrow throat leading into the dark heat of the roof, and I only went up there when I was looking for something specific. One afternoon, while hunting for old comic books, I pushed aside a heavy wool blanket and found my dad’s old military trunk. The latch gave way with a loud, aggressive snap that echoed in the cramped space, making me freeze in place. Inside were medals pinned to faded velvet and a pair of heavy boots that looked like they’d seen a lot of miles. I sat there in the dust motes, feeling like a trespasser in a story I wasn't allowed to read yet. The air was stifling, and the silence of the house below felt brittle, like it might shatter if I moved too quickly or stayed too long."}
{"gen": 0, "idx": 3, "p_human": 0.5683074950000032, "p_human_pct": 56.83074950000032, "len_chars": 780, "preview": "We weren't supposed to go near the abandoned cannery after sundown because the floorboards were rotted and the local teenagers supposedly hung out there to cause trouble. Naturally...", "text": "We weren't supposed to go near the abandoned cannery after sundown because the floorboards were rotted and the local teenagers supposedly hung out there to cause trouble. Naturally, that made the place a magnet for me and Ben. We climbed through a broken window one October evening, the jagged glass glinting like shark teeth in the fading orange light. Inside, the air was thick with the scent of stagnant water and something sour, like fermented fruit. Every time a piece of sheet metal groaned in the wind, I jumped high enough to lose my breath. Ben wanted to go deeper into the basement, but I stayed by the window, suddenly aware of how far away my bedroom felt. It wasn't the ghosts that scared me so much as the sudden, sharp understanding of how easily bones could break."}
{"gen": 0, "idx": 1, "p_human": 0.42893790296808787, "p_human_pct": 42.89379029680879, "len_chars": 794, "preview": "The old drainage pipe at the edge of the property was a dark, rusted mouth that seemed to swallow the creek whole whenever the summer storms hit. I remember crouching there in the ...", "text": "The old drainage pipe at the edge of the property was a dark, rusted mouth that seemed to swallow the creek whole whenever the summer storms hit. I remember crouching there in the tall, itchy grass, feeling the cold dampness of the concrete through my sneakers while my heart hammered against my ribs. I had a cheap plastic flashlight gripped so tight my knuckles turned white, and the beam flickered weakly against the slime-coated walls inside. There was this sharp, metallic smell of wet earth and decay that made my throat tighten, but I couldn't look away. I kept imagining something ancient living just past the reach of the light, watching me back. It was the first time I realized that the woods didn't care if I was there or not, and that realization felt heavier than the fear itself."}
{"gen": 0, "idx": 10, "p_human": 0.42078919577398255, "p_human_pct": 42.07891957739825, "len_chars": 720, "preview": "The woods behind the high school were off-limits after dark, mostly because of the steep ravine that dropped off without warning into a tangle of briars and sharp rocks. My brother...", "text": "The woods behind the high school were off-limits after dark, mostly because of the steep ravine that dropped off without warning into a tangle of briars and sharp rocks. My brother dared me to walk to the edge of the drop-off during a heavy fog, and I remember the way the mist felt like cold wet wool against my face. I could hear the water rushing at the bottom, a relentless, hungry sound that made my knees feel like they were made of water. I stood there for a long minute, looking into the grey void, wondering if I was the kind of person who would jump or the kind who would run. When I eventually turned back toward the lights of the houses, the fog followed me, clinging to my jacket like a secret I didn't want"}
