{"gen": 3, "idx": 2, "p_human": 0.8530910572394872, "p_human_pct": 85.30910572394872, "len_chars": 629, "preview": "There was a bird that hit the glass door. Mid-day heatwave. I remember finding it twitching still. Its chest heaving, frantic and uneven, making my stomach hurt. I knelt on the pat...", "text": "There was a bird that hit the glass door. Mid-day heatwave. I remember finding it twitching still. Its chest heaving, frantic and uneven, making my stomach hurt. I knelt on the patio stones. They were burning. My shadow covered the creature. I reached out a finger—then pulled it back. I wanted to help it, but I was terrified, too. That it might die right when I touched it, as if the life leaving it would... rub off on me somehow. I watched it for hours. Stuck between running for my mom and just needing to see what happened next. When it stopped, the backyard felt different. Sharper, I guess. Not like a playground anymore."}
{"gen": 3, "idx": 4, "p_human": 0.8269180843740492, "p_human_pct": 82.69180843740493, "len_chars": 654, "preview": "A bird hit the sliding glass door during a mid-day heatwave. I remember finding it. Twitching still. Its tiny chest heaved in a frantic, uneven rhythm that made my stomach turn. I ...", "text": "A bird hit the sliding glass door during a mid-day heatwave. I remember finding it. Twitching still. Its tiny chest heaved in a frantic, uneven rhythm that made my stomach turn. I knelt on the scorching patio stones, my shadow falling over the creature. I reached out a finger, then pulled back. I wanted to help it, I think. But I was terrified, too, that it might die while I was touching it. As if the life leaving it would somehow... rub off. I watched it for hours. Caught between the urge to run for my mom and a need to see what happened next. When it finally went still, the backyard felt different. Sharper, somehow. Much less like a playground."}
{"gen": 3, "idx": 3, "p_human": 0.8220823678864698, "p_human_pct": 82.20823678864699, "len_chars": 660, "preview": "I remember finding a bird in the middle of a heatwave; it had hit the sliding door. Twitching. Still. Its tiny chest heaved in this frantic rhythm... it made my stomach turn over. ...", "text": "I remember finding a bird in the middle of a heatwave; it had hit the sliding door. Twitching. Still. Its tiny chest heaved in this frantic rhythm... it made my stomach turn over. I knelt on the scorching stones. My shadow fell over the thing as I reached a finger out—then stopped. I wanted to help, maybe. But I was terrified that it might actually die while I was touching it. Like the life leaving it would somehow rub off on me. I watched it for what felt like hours. Caught between running for my mom and this strange, quiet need to see it happen. When it finally went still, the backyard felt different. Sharper. Less like a playground than it had been."}
{"gen": 3, "idx": 1, "p_human": 0.8158665742486578, "p_human_pct": 81.58665742486578, "len_chars": 708, "preview": "It was during a heatwave that the bird hit the sliding glass door. I remember finding it there. It was still twitching, its chest heaving in this frantic, uneven way... it made my ...", "text": "It was during a heatwave that the bird hit the sliding glass door. I remember finding it there. It was still twitching, its chest heaving in this frantic, uneven way... it made my stomach hurt just looking at it. I knelt on the patio stones—they were burning hot. My shadow fell over the creature. I reached a finger out, but then I pulled back. I wanted to help, I think, but I was scared. Terrified it might die the second I touched it, like the life leaving it could somehow get on me. I watched it for hours, it felt like. Stuck between getting my mom and just... needing to see what happened. When it stopped moving, the backyard felt different. Sharper. Less like a playground than it was that morning."}
{"gen": 3, "idx": 5, "p_human": 0.8140469869376101, "p_human_pct": 81.40469869376102, "len_chars": 637, "preview": "I was halfway down the stairs when the basement bulb just... burned out. Left me in darkness so thick it felt like it had mass. Normally I would have yelled for someone, but that n...", "text": "I was halfway down the stairs when the basement bulb just... burned out. Left me in darkness so thick it felt like it had mass. Normally I would have yelled for someone, but that night I stopped. Gripped the banister hard enough that the wood bit into my palm. I could hear the furnace droning, the TV upstairs... but those sounds felt miles away. I made myself take a step down. Then another one. My heart thumping against my ribs. I didn't find anything in the shadows, obviously. But when I flipped the switch at the bottom, the yellow light wasn't a relief. It felt like a disappointment, honestly. Just something I had to live with."}
{"gen": 3, "idx": 6, "p_human": 0.7483670965451665, "p_human_pct": 74.83670965451665, "len_chars": 590, "preview": "Halfway down the stairs, the basement bulb burned out. It left me in darkness so thick it felt like it had weight. Normally, I would have yelled, but that night I just... stopped. ...", "text": "Halfway down the stairs, the basement bulb burned out. It left me in darkness so thick it felt like it had weight. Normally, I would have yelled, but that night I just... stopped. I gripped the banister until the wood hurt my palm. I heard the furnace droning, the TV upstairs, but they felt like they belonged to a different world. I made myself take a step. Then another one, heart thumping against my ribs. I didn't find anything in the shadows, of course. But when I flipped the switch, the yellow light wasn't a relief. It felt like a disappointment. Something I just had to live with."}
