{"gen": 1, "idx": 1, "p_human": 0.8518729450726712, "p_human_pct": 85.18729450726713, "len_chars": 734, "preview": "I remember finding a bird during a mid-day heatwave; it had hit the sliding glass door. Twitching, still. Its tiny chest heaved in a frantic, uneven rhythm that made my stomach tur...", "text": "I remember finding a bird during a mid-day heatwave; it had hit the sliding glass door. Twitching, still. Its tiny chest heaved in a frantic, uneven rhythm that made my stomach turn over. I knelt on the scorching patio stones. My shadow fell over the creature as I reached out a finger—then pulled it back. I wanted to help it. But I was terrified, too, that it might actually die while I was touching it, as if the life leaving it would somehow rub off on me. I watched it for what felt like hours. I was caught between the urge to run for my mom and a strange, quiet need to see what happened next. When it finally went still, the backyard felt different. Sharper, somehow. Much less like a playground than it had been that morning."}
{"gen": 1, "idx": 3, "p_human": 0.7225746187171321, "p_human_pct": 72.25746187171322, "len_chars": 736, "preview": "The bulb in the basement sizzled out while I was only halfway down, leaving me suspended in a dark so thick it felt like it had actual mass. Normally, I would have screamed for som...", "text": "The bulb in the basement sizzled out while I was only halfway down, leaving me suspended in a dark so thick it felt like it had actual mass. Normally, I would have screamed for someone to come help, but that night I just... stayed put. I gripped the banister until the wood bit into my hand. I could hear the furnace droning and the TV mumbling upstairs, but those sounds felt like they belonged to a totally different world. I forced myself down a step, then another one, my heart hammering a frantic rhythm against my ribs. I didn't find anything lurking in the shadows, obviously, but when I finally hit the switch at the bottom, the yellow light didn't feel like a rescue. It felt more like a disappointment I just had to deal with."}
{"gen": 1, "idx": 2, "p_human": 0.6784579295977393, "p_human_pct": 67.84579295977393, "len_chars": 814, "preview": "When the circus actually came to town, I guess I was mostly fascinated by the tall man on stilts... but the lions in those cramped, traveling cages, they made my throat go kind of ...", "text": "When the circus actually came to town, I guess I was mostly fascinated by the tall man on stilts... but the lions in those cramped, traveling cages, they made my throat go kind of dry. I was standing inches from the bars—rusted ones—close enough that I could smell the raw, gamey scent of them. Their breath. I could even see the yellow chips in their teeth. Then one of them let out this low, vibrating growl I felt in my own jaw, and I stepped back so fast I think I tripped over a tent peg. I looked over at the trainer and he was just laughing, smoking a cigarette. I couldn't really understand how he could be that casual. Around something so dangerous. It bothered me for days after, just this sense that the world is full of sharp edges that people ignore because, I don't know, they just have chores to do."}
