{"gen": 5, "idx": 5, "p_human": 0.8650934805655602, "p_human_pct": 86.50934805655602, "len_chars": 620, "preview": "There was a bird that hit the glass door. Mid-day heatwave. I remember finding it twitching still. Chest heaving, frantic and uneven... made my stomach hurt. I knelt on the patio s...", "text": "There was a bird that hit the glass door. Mid-day heatwave. I remember finding it twitching still. Chest heaving, frantic and uneven... made my stomach hurt. I knelt on the patio stones; they were burning. My shadow covered the hapless creature. I reached out a finger—then pulled it back. I wanted to help it, but I was terrified. That it might die right when I touched it, as if the life leaving it would rub off on me somehow. I watched it for hours. Stuck between running for my mom and just needing to see what happened next. When it stopped, the backyard felt different. Sharper, I guess. Not a playground anymore."}
{"gen": 5, "idx": 1, "p_human": 0.8627619716115575, "p_human_pct": 86.27619716115575, "len_chars": 628, "preview": "Mid-day heatwave. A bird hit the glass door. I remember finding it there, twitching still. Its chest was heaving, frantic and uneven. Making my stomach hurt. I knelt on the patio s...", "text": "Mid-day heatwave. A bird hit the glass door. I remember finding it there, twitching still. Its chest was heaving, frantic and uneven. Making my stomach hurt. I knelt on the patio stones—they were burning. My shadow covered the creature. I reached out a finger, then pulled it back. I wanted to help it, but I was terrified, too. That it might perish right when I touched it, as if the life leaving it would... rub off on me somehow. I watched it for hours. Stuck between running for my mom and just needing to see what happened next. When it stopped, the backyard felt different. Sharper, I guess. Not like a playground anymore."}
{"gen": 5, "idx": 3, "p_human": 0.8479189845815108, "p_human_pct": 84.79189845815108, "len_chars": 616, "preview": "A bird hit the glass door. Mid-day heatwave. I remember finding it twitching still. Its chest heaving, frantic and uneven... making my stomach hurt. I knelt on the patio stones. Th...", "text": "A bird hit the glass door. Mid-day heatwave. I remember finding it twitching still. Its chest heaving, frantic and uneven... making my stomach hurt. I knelt on the patio stones. They were burning. My shadow covered the wretched thing. I reached out a finger—then recoiled. I wanted to help it, but I was terrified. That it might die right when I touched it, as if the life leaving it would rub off on me somehow. I watched it for hours. Stuck between running for my mom and just needing to see what happened next. When it finally stopped, the backyard felt different. Sharper, I guess. Not like a playground anymore."}
{"gen": 5, "idx": 4, "p_human": 0.8451679116442464, "p_human_pct": 84.51679116442465, "len_chars": 593, "preview": "Bird hit the glass door. Mid-day heatwave. I remember finding it twitching still. Its chest heaving, fretful and uneven... making my stomach turn. I knelt on the patio stones. They...", "text": "Bird hit the glass door. Mid-day heatwave. I remember finding it twitching still. Its chest heaving, fretful and uneven... making my stomach turn. I knelt on the patio stones. They were burning. My shadow covered the thing. I reached out a finger—then pulled back. I wanted to help it, but I was terrified. That it might die right when I touched it, as if the life leaving it would rub off on me. I watched it for hours. Caught between running for my mom and just needing to see what happened next. When it stopped, the backyard felt different. Sharper, I guess. Not like a playground anymore."}
{"gen": 5, "idx": 6, "p_human": 0.8243564424928511, "p_human_pct": 82.4356442492851, "len_chars": 606, "preview": "Mid-day heatwave. A bird hit the glass door. I remember finding it there, twitching still. Its chest heaving, frantic and uneven... making my stomach hurt. I knelt on the patio sto...", "text": "Mid-day heatwave. A bird hit the glass door. I remember finding it there, twitching still. Its chest heaving, frantic and uneven... making my stomach hurt. I knelt on the patio stones. They were burning. My shadow covered the lamentable thing. I reached out a finger—then pulled it back. I wanted to help it, but I was terrified. That it might die right when I touched it, as if the life leaving it would rub off on me. I watched it for hours. Stuck between running for my mom and just needing to see what happened next. When it stopped, the backyard felt different. Sharper. Not like a playground anymore."}
{"gen": 5, "idx": 2, "p_human": 0.8150471746571943, "p_human_pct": 81.50471746571944, "len_chars": 616, "preview": "Heatwave, mid-day. A bird hit the glass door. I remember finding it there... twitching still. Its chest heaving in this frantic, uneven way that made my stomach hurt. I knelt on th...", "text": "Heatwave, mid-day. A bird hit the glass door. I remember finding it there... twitching still. Its chest heaving in this frantic, uneven way that made my stomach hurt. I knelt on the patio stones. They were burning hot. My shadow covered the creature. I reached out a finger—then pulled it back. I wanted to help it, but I was terrified. That it might die right when I touched it, as if the life leaving it would taint me somehow. I watched it for hours. Stuck between running for my mom and just needing to see what happened next. When it stopped, the backyard felt different. Sharper. Not like a playground anymore."}
