{"gen": 3, "idx": 1, "p_human": 0.8647234613304766, "p_human_pct": 86.47234613304767, "len_chars": 628, "preview": "Mid-day heatwave. A bird hit the glass door. I remember finding it there, twitching still. Its chest was heaving, frantic and uneven, making my stomach hurt. I knelt on the patio s...", "text": "Mid-day heatwave. A bird hit the glass door. I remember finding it there, twitching still. Its chest was heaving, frantic and uneven, making my stomach hurt. I knelt on the patio stones—they were burning. My shadow covered the creature. I reached out a finger, then pulled it back. I wanted to help it, but I was terrified, too. That it might perish right when I touched it, as if the life leaving it would... rub off on me somehow. I watched it for hours. Stuck between running for my mom and just needing to see what happened next. When it stopped, the backyard felt different. Sharper, I guess. Not like a playground anymore."}
{"gen": 3, "idx": 2, "p_human": 0.8594669525257703, "p_human_pct": 85.94669525257703, "len_chars": 629, "preview": "There was a bird that hit the glass door. Mid-day heatwave. I remember finding it twitching still. Its chest heaving, frantic and uneven... making my stomach hurt. I knelt on the p...", "text": "There was a bird that hit the glass door. Mid-day heatwave. I remember finding it twitching still. Its chest heaving, frantic and uneven... making my stomach hurt. I knelt on the patio stones. They were burning. My shadow covered the wretched thing. I reached out a finger—then pulled it back. I wanted to help it, but I was terrified. That it might die right when I touched it, as if the life leaving it would rub off on me somehow. I watched it for hours. Stuck between running for my mom and just needing to see what happened next. When it stopped, the backyard felt different. Sharper, I guess. Not like a playground anymore."}
{"gen": 3, "idx": 4, "p_human": 0.8288735037875148, "p_human_pct": 82.88735037875148, "len_chars": 646, "preview": "A bird hit the sliding glass door. Heatwave. I remember finding it... twitching still. Its tiny chest heaved in a frantic, uneven rhythm that made my stomach turn. I knelt on the s...", "text": "A bird hit the sliding glass door. Heatwave. I remember finding it... twitching still. Its tiny chest heaved in a frantic, uneven rhythm that made my stomach turn. I knelt on the scorching patio stones, my shadow falling over the stricken creature. I reached out a finger, then pulled back. I wanted to help it, I think. But I was terrified, too, that it might die while I was touching it. As if the life leaving it would somehow rub off. I watched it for hours. Caught between the urge to run for my mom and a need to see what happened next. When it finally went still, the backyard felt different. Sharper, somehow. Much less like a playground."}
{"gen": 3, "idx": 5, "p_human": 0.824139744445245, "p_human_pct": 82.4139744445245, "len_chars": 661, "preview": "I remember finding a bird in the middle of a heatwave; it had hit the sliding door. Twitching. Still. Its tiny chest heaved in this frantic rhythm... it made my stomach turn over. ...", "text": "I remember finding a bird in the middle of a heatwave; it had hit the sliding door. Twitching. Still. Its tiny chest heaved in this frantic rhythm... it made my stomach turn over. I knelt on the scorching stones. My shadow fell over the thing as I reached a finger out—then stopped. I wanted to help, maybe. But I was terrified that it might actually die while I was touching it. Like the life leaving it would somehow rub off on me. I watched it for what felt like hours. Caught between running for my mom and this strange, morbid need to see it happen. When it finally went still, the backyard felt different. Sharper. Less like a playground than it had been."}
{"gen": 3, "idx": 3, "p_human": 0.8189734633941445, "p_human_pct": 81.89734633941444, "len_chars": 660, "preview": "A bird hit the sliding glass door during a mid-day heatwave. I remember finding it. Twitching still. Its tiny chest heaved in a frantic, uneven rhythm that made my stomach turn. I ...", "text": "A bird hit the sliding glass door during a mid-day heatwave. I remember finding it. Twitching still. Its tiny chest heaved in a frantic, uneven rhythm that made my stomach turn. I knelt on the scorching patio stones, my shadow falling over the creature. I reached out a finger, then pulled back. I wanted to help it, I think. But I was terrified, too, that it might die while I was touching it. As if the life leaving it would somehow... rub off. I watched it for hours. Caught between the urge to run for my mom and a compulsion to see what happened next. When it finally went still, the backyard felt different. Sharper, somehow. Much less like a playground."}
{"gen": 3, "idx": 6, "p_human": 0.8153472761342486, "p_human_pct": 81.53472761342486, "len_chars": 658, "preview": "I remember finding a bird in the middle of a heatwave. It had hit the sliding door. Twitching. Still. Its tiny chest heaved in this frantic rhythm... made my stomach turn over. I k...", "text": "I remember finding a bird in the middle of a heatwave. It had hit the sliding door. Twitching. Still. Its tiny chest heaved in this frantic rhythm... made my stomach turn over. I knelt on the scorching stones. My shadow fell over the thing as I reached a finger out—then recoiled. I wanted to help, maybe. But I was terrified that it might actually die while I was touching it. Like the life leaving it would somehow rub off on me. I watched it for what felt like hours. Caught between running for my mom and this strange, quiet need to see it happen. When it finally went still, the backyard felt different. Sharper. Less like a playground than it had been."}
